### ref: https://qiita.com/vochicong/items/f20afc89a6847cd58f0f
<<<<<<< HEAD
# brew tap homebrew/bundle

cask_args appdir: "/Applications"
tap "caskroom/cask"
=======

### Install directory that using installer file
cask_args appdir: "/Applications"

### 
tap "homebrew/cask"
>>>>>>> origin/master
tap "homebrew/bundle"
tap "homebrew/core"
tap "sanemat/font"

<<<<<<< HEAD
cask "xquartz"
brew "automake"
brew "direnv"
brew "envchain"
brew "fish"
brew "pkg-config"
brew "fontforge"
brew "ghq"
brew "hub"
brew "peco"
brew "pyenv"
brew "rbenv"
brew "s3cmd"
brew "tig"
brew "tree"
brew "wget"
brew "tmux"
brew "zsh"
brew "zsh-completions"
brew "sanemat/font/ricty"
=======
### Install command line tools
#brew "automake"
brew "anyenv"
brew "awscli"
brew "aws-sam-cli"
brew "aws-sam-cli-beta-cdk"
brew "batcat"
brew "bzip2"
brew "coreutils"
brew "direnv"
brew "docker"
brew "envchain"
brew "exa"
brew "fish"
brew "fontforge"
brew "ghq"
brew "gnutls"
brew "gron"
brew "hub"
brew "jq"
brew "peco"
brew "pkg-config"
brew "pwgen"
brew "s3cmd"
brew "tig"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-completions"

### Install fonts
cask "font-ricty-diminished"
brew "sanemat/font/ricty"

### Install desktop applications
cask "alfred"
cask "google-japanese-ime"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "notion"
cask "postman"
cask "rectangle"
cask "skitch"
cask "slack"
cask "visual-studio-code"
cask "xquartz"

>>>>>>> origin/master
