### ref: https://qiita.com/vochicong/items/f20afc89a6847cd58f0f

### Install directory that using installer file
cask_args appdir: "/Applications"

### Main
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "sanemat/font"
tap "aws/tap"

### Install command line tools
#brew "automake"
brew "anyenv"
brew "authy"
brew "awscli"
brew "aws-sam-cli"
brew "aws-sam-cli-beta-cdk"
brew "aws-vault"
brew "bat"
brew "bzip2"
brew "coreutils"
brew "direnv"
brew "envchain"
brew "exa"
brew "fontforge"
brew "ghq"
brew "gnutls"
brew "gron"
brew "htop"
brew "hub"
brew "jq"
brew "peco"
brew "php"  # for Alfred plugins
brew "pkg-config"
brew "pwgen"
brew "saml2aws"
brew "s3cmd"
brew "tig"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-completions"

### Install fonts
cask "font-ricty-diminished"
brew "sanemat/font/ricty"

### Install desktop applications
cask "google-japanese-ime"
cask "google-chrome"
cask "notion"
cask "slack"
cask "visual-studio-code"

### Only macOS
if OS.mac?
  cask "alfred"
  cask "docker"
  cask "font-hack-nerd-font"
  cask "karabiner-elements"
  cask "iterm2"
  cask "macvim"
  cask "postman"
  cask "rambox"
  cask "rectangle"
  cask "session-manager-plugin"
  cask "skitch"
  cask "xquartz"
#elseif OS.linux?
end

